test/fixtures/stripe_events/invoice.paid.json

{
  "api_version": "2024-06-20",
  "created": 1728203228,
  "data": {
    "object": {
      "account_country": "JP",
      "account_name": "Test",
      "account_tax_ids": null,
      "amount_due": 1500,
      "amount_paid": 1500,
      "amount_remaining": 0,
      "amount_shipping": 0,
      "application": null,
      "application_fee_amount": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "automatic_tax": {
        "enabled": false,
        "liability": null,
        "status": null
      },
      "automatically_finalizes_at": null,
      "billing_reason": "subscription_create",
      "charge": "ch_3Q6pnyHWdrSF9AyB0GISRFTq",
      "collection_method": "charge_automatically",
      "created": 1728203226,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_QynOslZSmXOcAQ",
      "customer_address": null,
      "customer_email": null,
      "customer_name": null,
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "due_date": null,
      "effective_at": 1728203226,
      "ending_balance": 0,
      "footer": null,
      "from_invoice": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_17BiSpHWdrSF9AyB/test_YWNjdF8xN0JpU3BIV2RyU0Y5QXlCLF9ReW5PYnlzcHJpaWhIV1ZWTThFczRXdnBEb3NzT0JSLDExODc0NDAyOQ02000LHlgo0p?s=ap",
      "id": "in_1Q6pnyHWdrSF9AyBBaynIG5k",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_17BiSpHWdrSF9AyB/test_YWNjdF8xN0JpU3BIV2RyU0Y5QXlCLF9ReW5PYnlzcHJpaWhIV1ZWTThFczRXdnBEb3NzT0JSLDExODc0NDAyOQ02000LHlgo0p/pdf?s=ap",
      "issuer": {
        "type": "self"
      },
      "last_finalization_error": null,
      "latest_revision": null,
      "lines": {
        "data": [
          {
            "amount": 1500,
            "amount_excluding_tax": 1500,
            "currency": "usd",
            "description": "1 × myproduct (at $15.00 / month)",
            "discount_amounts": [],
            "discountable": true,
            "discounts": [],
            "id": "il_1Q6pnyHWdrSF9AyBUUJZyJiK",
            "invoice": "in_1Q6pnyHWdrSF9AyBBaynIG5k",
            "livemode": false,
            "metadata": {},
            "object": "line_item",
            "period": {
              "end": 1730881626,
              "start": 1728203226
            },
            "plan": {
              "active": true,
              "aggregate_usage": null,
              "amount": 1500,
              "amount_decimal": "1500",
              "billing_scheme": "per_unit",
              "created": 1728203225,
              "currency": "usd",
              "id": "price_1Q6pnxHWdrSF9AyB6a3jxjOV",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "meter": null,
              "nickname": null,
              "object": "plan",
              "product": "prod_QynOECagWrjPT0",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1728203225,
              "currency": "usd",
              "custom_unit_amount": null,
              "id": "price_1Q6pnxHWdrSF9AyB6a3jxjOV",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "object": "price",
              "product": "prod_QynOECagWrjPT0",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "meter": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 1500,
              "unit_amount_decimal": "1500"
            },
            "proration": false,
            "proration_details": {
              "credited_items": null
            },
            "quantity": 1,
            "subscription": "sub_1Q6pnyHWdrSF9AyBO5l15rNi",
            "subscription_item": "si_QynOVz1KsIixvl",
            "tax_amounts": [],
            "tax_rates": [],
            "type": "subscription",
            "unit_amount_excluding_tax": "1500"
          }
        ],
        "has_more": false,
        "object": "list",
        "total_count": 1,
        "url": "/v1/invoices/in_1Q6pnyHWdrSF9AyBBaynIG5k/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": null,
      "number": "E6BF4EC9-0001",
      "object": "invoice",
      "on_behalf_of": null,
      "paid": true,
      "paid_out_of_band": false,
      "payment_intent": "pi_3Q6pnyHWdrSF9AyB02eSPkAu",
      "payment_settings": {
        "default_mandate": null,
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1728203226,
      "period_start": 1728203226,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "quote": null,
      "receipt_number": null,
      "rendering": null,
      "shipping_cost": null,
      "shipping_details": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1728203226,
        "marked_uncollectible_at": null,
        "paid_at": 1728203226,
        "voided_at": null
      },
      "subscription": "sub_1Q6pnyHWdrSF9AyBO5l15rNi",
      "subscription_details": {
        "metadata": {}
      },
      "subtotal": 1500,
      "subtotal_excluding_tax": 1500,
      "tax": null,
      "test_clock": null,
      "total": 1500,
      "total_discount_amounts": [],
      "total_excluding_tax": 1500,
      "total_tax_amounts": [],
      "transfer_data": null,
      "webhooks_delivered_at": null
    }
  },
  "id": "evt_1Q6po1HWdrSF9AyB7l2M3cul",
  "livemode": false,
  "object": "event",
  "pending_webhooks": 2,
  "request": {
    "id": "req_GIR7XhFYjJkVCG",
    "idempotency_key": "842f2e1d-765e-4ba6-b694-37830130767f"
  },
  "type": "invoice.paid"
}
